<a href="https://colab.research.google.com/github/amindazad/GCC_Vegtables_Market/blob/main/GCC_Vegetables_Market_Analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [45]:
# Import required libraries
import pandas as pd
import numpy as np

In [46]:
UAE = pd.read_csv("https://raw.githubusercontent.com/amindazad/GCC_Vegtables_Market/main/UAE_Vegtables_Trade_Statistics_2015_2019.csv", header=0)
Saudi = pd.read_csv("https://raw.githubusercontent.com/amindazad/GCC_Vegtables_Market/main/Saudi_Vegtables_Trade_Statistics_2015-2019.csv", header=0)
Qatar = pd.read_csv("https://raw.githubusercontent.com/amindazad/GCC_Vegtables_Market/main/Qatar_Vetables_Trade_Statistics_2015_2019.csv", header=0)
Oman = pd.read_csv("https://raw.githubusercontent.com/amindazad/GCC_Vegtables_Market/main/Oman_Vegtables_Trade_Statistics_2015_2019.csv", header=0)
Kuwait = pd.read_csv("https://raw.githubusercontent.com/amindazad/GCC_Vegtables_Market/main/Kuwait_Vegtables_Trade_Statistics_2015_2019.csv", header=0)
Bahrain = pd.read_csv("https://raw.githubusercontent.com/amindazad/GCC_Vegtables_Market/main/Bahrain_Vegtables_Trade_Statistics_2015_2019.csv", header=0)

In [47]:
print(UAE.shape)
UAE.head()

(71, 8)

  Country     Code  ... Imported value in 2018  Imported value in 2019
0     UAE  '071340  ...                 103223                  114192
1     UAE  '070999  ...                 100864                   98916
2     UAE  '070310  ...                  90827                   89108
3     UAE  '070200  ...                 100664                   86473
4     UAE  '071320  ...                  94462                   65450

[5 rows x 8 columns]

In [48]:
# Check for NaN values
UAE.isnull().sum()

Country                   0
Code                      0
Product label             0
Imported value in 2015    0
Imported value in 2016    0
Imported value in 2017    0
Imported value in 2018    0
Imported value in 2019    0
dtype: int64

In [49]:
print(Saudi.shape)
Saudi.head()

(71, 8)

        Country     Code  ... Imported value in 2018  Imported value in 2019
0  Saudi Arabia  '070200  ...                  79110                   86784
1  Saudi Arabia  '070310  ...                 119844                   83625
2  Saudi Arabia  '070320  ...                  36361                   51752
3  Saudi Arabia  '071320  ...                  50843                   42160
4  Saudi Arabia  '070511  ...                  35849                   38972

[5 rows x 8 columns]

In [50]:
# Check for NaN values
Saudi.isnull().sum()

Country                   0
Code                      0
Product label             0
Imported value in 2015    0
Imported value in 2016    0
Imported value in 2017    0
Imported value in 2018    0
Imported value in 2019    0
dtype: int64

In [51]:
print(Qatar.shape)
Qatar.head()

(72, 8)

  Country     Code  ... Imported value in 2018  Imported value in 2019
0   Qatar  '070310  ...                  31594                   28633
1   Qatar  '070200  ...                  29875                   26529
2   Qatar  '070999  ...                  37800                   18612
3   Qatar  '070960  ...                  16359                   15021
4   Qatar  '070110  ...                  15359                   14651

[5 rows x 8 columns]

In [52]:
# Check for NaN values
Qatar.isnull().sum()

Country                    0
Code                       0
Product label              0
Imported value in 2015     0
Imported value in 2016    72
Imported value in 2017     0
Imported value in 2018     0
Imported value in 2019     0
dtype: int64

In [53]:
Qatar[Qatar.isna().any(axis=1)]

   Country     Code  ... Imported value in 2018  Imported value in 2019
0    Qatar  '070310  ...                  31594                   28633
1    Qatar  '070200  ...                  29875                   26529
2    Qatar  '070999  ...                  37800                   18612
3    Qatar  '070960  ...                  16359                   15021
4    Qatar  '070110  ...                  15359                   14651
..     ...      ...  ...                    ...                     ...
67   Qatar  '070990  ...                      0                       0
68   Qatar  '070952  ...                      0                       0
69   Qatar  '070529  ...                     30                       0
70   Qatar  '070890  ...                    172                       0
71   Qatar  '070910  ...                      0                       0

[72 rows x 8 columns]

In [54]:
# Replace NaN values with the row's mean. I chose row mean because replaced
# values are specific to each product
Qatar = Qatar.T.fillna(Qatar.mean(axis=1)).T
Qatar

   Country     Code  ... Imported value in 2018 Imported value in 2019
0    Qatar  '070310  ...                  31594                  28633
1    Qatar  '070200  ...                  29875                  26529
2    Qatar  '070999  ...                  37800                  18612
3    Qatar  '070960  ...                  16359                  15021
4    Qatar  '070110  ...                  15359                  14651
..     ...      ...  ...                    ...                    ...
67   Qatar  '070990  ...                      0                      0
68   Qatar  '070952  ...                      0                      0
69   Qatar  '070529  ...                     30                      0
70   Qatar  '070890  ...                    172                      0
71   Qatar  '070910  ...                      0                      0

[72 rows x 8 columns]

In [55]:
print(Oman.shape)
Oman.head()

(69, 8)

  Country     Code  ... Imported value in 2018  Imported value in 2019
0    Oman  '070310  ...                  26262                 25032.0
1    Oman  '070190  ...                  28926                 23798.0
2    Oman  '070200  ...                  16949                 14268.0
3    Oman  '070320  ...                  10985                 13580.0
4    Oman  '071320  ...                  10061                  8797.0

[5 rows x 8 columns]

In [56]:
# Check for NaN values
Oman.isnull().sum()

Country                   0
Code                      0
Product label             0
Imported value in 2015    0
Imported value in 2016    0
Imported value in 2017    0
Imported value in 2018    0
Imported value in 2019    5
dtype: int64

In [69]:
# Replace NaN values with the row's mean. I chose row mean because replaced
# values are specific to each product
Oman = Oman.T.fillna(Oman.mean(axis=1)).T
Oman.isnull().sum()

Country                   0
Code                      0
Product label             0
Imported value in 2015    0
Imported value in 2016    0
Imported value in 2017    0
Imported value in 2018    0
Imported value in 2019    0
dtype: int64

In [57]:
print(Kuwait.shape)
Kuwait.head()

(70, 8)

  Country     Code  ... Imported value in 2018  Imported value in 2019
0  Kuwait  '070200  ...                  32509                 36022.0
1  Kuwait  '070190  ...                  38200                 21478.0
2  Kuwait  '070310  ...                  37638                 21394.0
3  Kuwait  '070960  ...                  17215                 20992.0
4  Kuwait  '070999  ...                  50434                 19663.0

[5 rows x 8 columns]

In [58]:
# Check for NaN values
Kuwait.isnull().sum()

Country                   0
Code                      0
Product label             0
Imported value in 2015    0
Imported value in 2016    0
Imported value in 2017    0
Imported value in 2018    0
Imported value in 2019    6
dtype: int64

In [70]:
# Replace NaN values with the row's mean. I chose row mean because replaced
# values are specific to each product
Kuwait = Kuwait.T.fillna(Kuwait.mean(axis=1)).T
Kuwait.isnull().sum()

Country                   0
Code                      0
Product label             0
Imported value in 2015    0
Imported value in 2016    0
Imported value in 2017    0
Imported value in 2018    0
Imported value in 2019    0
dtype: int64

In [71]:
print(Bahrain.shape)
Bahrain.head()

(72, 8)

   Country     Code  ... Imported value in 2018 Imported value in 2019
0  Bahrain  '070200  ...                  13963                  17583
1  Bahrain  '070999  ...                  16614                  11934
2  Bahrain  '070310  ...                  15774                  11803
3  Bahrain  '070960  ...                   8852                   8711
4  Bahrain  '070190  ...                  12031                   6606

[5 rows x 8 columns]

In [72]:
# Check for NaN values
Bahrain.isnull().sum()

Country                   0
Code                      0
Product label             0
Imported value in 2015    0
Imported value in 2016    0
Imported value in 2017    0
Imported value in 2018    0
Imported value in 2019    0
dtype: int64

In [73]:
Bahrain[Bahrain.isna().any(axis=1)]

Empty DataFrame
Columns: [Country, Code, Product label, Imported value in 2015, Imported value in 2016, Imported value in 2017, Imported value in 2018, Imported value in 2019]
Index: []

In [74]:
Bahrain = Bahrain.T.fillna(Bahrain.mean(axis=1)).T
Bahrain

    Country     Code  ... Imported value in 2018 Imported value in 2019
0   Bahrain  '070200  ...                  13963                  17583
1   Bahrain  '070999  ...                  16614                  11934
2   Bahrain  '070310  ...                  15774                  11803
3   Bahrain  '070960  ...                   8852                   8711
4   Bahrain  '070190  ...                  12031                   6606
..      ...      ...  ...                    ...                    ...
67  Bahrain  '071130  ...                      0                      0
68  Bahrain  '071110  ...                      0                      0
69  Bahrain  '070990  ...                      0                    0.5
70  Bahrain  '070952  ...                      0                      0
71  Bahrain  '070910  ...                      0                      0

[72 rows x 8 columns]

In [75]:
# Merge Datasets
df1 = pd.concat([UAE, Saudi])
df2 = pd.concat([df1, Qatar])
df3 = pd.concat([df2, Oman])
df4 = pd.concat([df3, Kuwait])
GCC = pd.concat([df4, Bahrain])
GCC

    Country     Code  ... Imported value in 2018 Imported value in 2019
0       UAE  '071340  ...                 103223                 114192
1       UAE  '070999  ...                 100864                  98916
2       UAE  '070310  ...                  90827                  89108
3       UAE  '070200  ...                 100664                  86473
4       UAE  '071320  ...                  94462                  65450
..      ...      ...  ...                    ...                    ...
67  Bahrain  '071130  ...                      0                      0
68  Bahrain  '071110  ...                      0                      0
69  Bahrain  '070990  ...                      0                    0.5
70  Bahrain  '070952  ...                      0                      0
71  Bahrain  '070910  ...                      0                      0

[425 rows x 8 columns]

In [76]:
# Finding Null Values and replacing them with 0
GCC.isnull().sum()

Country                   0
Code                      0
Product label             0
Imported value in 2015    0
Imported value in 2016    0
Imported value in 2017    0
Imported value in 2018    0
Imported value in 2019    0
dtype: int64

In [66]:
GCC["Product label"].value_counts()

Fresh or chilled globe artichokes                                                                       12
Fresh or chilled salad beetroot, salsify, celeriac, radishes and similar edible roots (excluding ...     6
Dried, shelled cow peas "Vigna unguiculata", whether or not skinned or split                             6
Dried, shelled broad beans "Vicia faba var. major" and horse beans "Vicia faba var. equina ...           6
Fresh or chilled cabbage lettuce                                                                         6
                                                                                                        ..
Fresh or chilled truffles                                                                                5
Capers provisionally preserved, e.g. by sulphur dioxide gas, in brine, in sulphur water or ...           4
Dried mushrooms and truffles, whole, cut, sliced, broken or in powder, but not further prepared          4
Onions provisionally preserved, e.g. by sulphur dioxide gas, in brine, in sulphur water or ...           2
Yautia "Xanthosoma spp.", fresh, chilled, frozen or dried, whether or not sliced or in the ...           2
Name: Product label, Length: 72, dtype: int64